## Plan Result (terraform/live/development/others)

[CI link](https://github.com/nakashima-yuta23-fixer/renovate-terraform/actions/runs/12028104109)



<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_container_registry.acr
  * azurerm_log_analytics_workspace.this



<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_container_registry.acr will be created
  + resource "azurerm_container_registry" "acr" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "japaneast"
      + login_server                  = (known after apply)
      + name                          = "containerRegistry1"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "resource_group_name"
      + sku                           = "Premium"
      + trust_policy_enabled          = false
      + zone_redundancy_enabled       = false
    }

  # azurerm_log_analytics_workspace.this will be created
  + resource "azurerm_log_analytics_workspace" "this" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "japaneast"
      + name                            = "log-nytes1-dev-je"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "resource_group_name"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + workspace_id                    = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"pull_request-triger","PRNumber":16,"Program":"tfcmt","SHA1":"ae90809dc1f6dd5f18984055cb60ebac1d708197","Target":"terraform/live/development/others","Vars":{},"WorkflowName":"Pull request trigger"} -->